tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koekeishiya/formulae"

brew "bat"
brew "chezmoi"
brew "cocoapods"
brew "eza"
brew "gh"
brew "git"
brew "gnupg"
brew "hydra"
brew "mise"
brew "neofetch"
brew "pinentry-mac"
brew "sheldon"
brew "starship"
brew "tree"
brew "typst"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

cask "alacritty"
cask "android-platform-tools"
cask "arc"
cask "canva"
cask "discord"
cask "figma"
cask "font-jetbrains-mono-nerd-font"
cask "ghidra"
cask "gpg-suite"
cask "karabiner-elements"
cask "keybase"
cask "notion"
cask "orbstack"
cask "raycast"
cask "slack"
cask "typora"
cask "visual-studio-code"
cask "xquartz"

vscode "adam-bender.commit-message-editor"
vscode "eamodio.gitlens"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "leonardssh.vscord"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "nvarner.typst-lsp"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
